# Triangulate Method (Double) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Face..::..Triangulate Method (Double)
Face Class See Also
---
Returns a triangular mesh approximation to the face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public Mesh Triangulate(
	double levelOfDetail
)
```

Visual Basic
---
```text
Public Function Triangulate ( _
	levelOfDetail As Double _
) As Mesh
```

Visual C++
---
```text
public:
Mesh^ Triangulate(
	double levelOfDetail
)
```

# ### Parameters
levelOfDetail
    Type: System..::..DoubleThe level of detail. Its range is from 0 to 1. 0 is the lowest level of detail and 1 is the highest.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when level of detail is less than 0 or greater than 1. |

# See Also
Face Class
Triangulate Overload
Autodesk.Revit.DB Namespace